# Assignment

#### Import Data

In [42]:
import pandas as pd
df = pd.read_csv("Chocolate_Sales.csv")

In [43]:
df.head()

,Sales Person,Country,Product,Date,Amount,Boxes Shipped
0,Jehu Rudeforth,UK,Mint Chip Choco,4-Jan-22,"$5,320",180
1,Van Tuxwell,India,85% Dark Bars,1-Aug-22,"$7,896",94
2,Gigi Bohling,India,Peanut Butter Cubes,7-Jul-22,"$4,501",91
3,Jan Morforth,Australia,Peanut Butter Cubes,27-Apr-22,"$12,726",342
4,Jehu Rudeforth,UK,Peanut Butter Cubes,24-Feb-22,"$13,685",184

In [44]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1094 entries, 0 to 1093
Data columns (total 6 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Sales Person   1094 non-null   object
 1   Country        1094 non-null   object
 2   Product        1094 non-null   object
 3   Date           1094 non-null   object
 4   Amount         1094 non-null   object
 5   Boxes Shipped  1094 non-null   int64
dtypes: int64(1), object(5)
memory usage: 51.4+ KB

#### Cleaning Data

In [45]:
df.isnull().sum()
#Since it is zero for every column, therefore there is no empty data

Sales Person     0
Country          0
Product          0
Date             0
Amount           0
Boxes Shipped    0
dtype: int64

In [46]:
df.duplicated().sum()
#Since there is no duplicated data, therefore there is no need to remove duplicated

0

#### Process Data

In [50]:
df["Date"] = pd.to_datetime(df["Date"])
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1094 entries, 0 to 1093
Data columns (total 6 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Sales Person   1094 non-null   object
 1   Country        1094 non-null   object
 2   Product        1094 non-null   object
 3   Date           1094 non-null   datetime64[ns]
 4   Amount         1094 non-null   object
 5   Boxes Shipped  1094 non-null   int64
dtypes: datetime64[ns](1), int64(1), object(4)
memory usage: 51.4+ KB

C:\Users\juanz\AppData\Local\Temp\ipykernel_10852\1130716863.py:1: UserWarning: Could not infer format, so each element will be parsed individually, falling back to `dateutil`. To ensure parsing is consistent and as-expected, please specify a format.
  df["Date"] = pd.to_datetime(df["Date"])

In [51]:
def removeDollarSign(money):
    return money.replace("$", "").replace(",","")

df["Amount"] = pd.to_numeric(df["Amount"].apply(removeDollarSign))

In [52]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1094 entries, 0 to 1093
Data columns (total 6 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Sales Person   1094 non-null   object
 1   Country        1094 non-null   object
 2   Product        1094 non-null   object
 3   Date           1094 non-null   datetime64[ns]
 4   Amount         1094 non-null   int64
 5   Boxes Shipped  1094 non-null   int64
dtypes: datetime64[ns](1), int64(2), object(3)
memory usage: 51.4+ KB

#### Exploratory Data Analysis (EDA)

##### a. The general information about the entire data set Chocolate_Sales.csv

##### b. List the chocolates sold out to India.

In [53]:
# Find all the name of the chocolates that sold out to India
products = df.loc[df["Country"] == "India"]["Product"]

# Find the name of chocolates
products.unique()

array(['85% Dark Bars', 'Peanut Butter Cubes', 'Smooth Sliky Salty',
       'Fruit & Nut Bars', 'Manuka Honey Choco', 'Spicy Special Slims',
       'Eclairs', 'Almond Choco', '99% Dark & Pure', '50% Dark Bites',
       'Organic Choco Syrup', 'Raspberry Choco', 'Orange Choco',
       'Caramel Stuffed Bars', "Baker's Choco Chips", 'After Nines',
       'Drinking Coco', '70% Dark Bites', 'Milk Bars', 'Mint Chip Choco',
       'Choco Coated Almonds', 'White Choc'], dtype=object)

##### c. Identify the salesperson with the highest sales by ranking them based on 
sales amount.

In [ ]:
df.groupby(["Sales Person"])["Amount"].sum().sort_values(ascending=False)

Sales Person
Ches Bonnell           320901
Oby Sorrel             316645
Madelene Upcott        316099
Brien Boise            312816
Kelci Walkden          311710
Van Tuxwell            303149
Dennison Crosswaite    291669
Beverie Moffet         278922
Kaine Padly            266490
Marney O'Breen         259742
Barr Faughny           258713
Roddy Speechley        251062
Gunar Cockshoot        238483
Gigi Bohling           232666
Karlen McCaffrey       223895
Jehu Rudeforth         220976
Jan Morforth           219667
Curtice Advani         216461
Rafaelita Blaksland    210245
Husein Augar           205212
Andria Kimpton         201747
Mallorie Waber         200592
Camilla Castle         196616
Dotty Strutley         190624
Wilone O'Kielt         138523
Name: Amount, dtype: int64

Ches Bonnell

##### d. Find all sales region or store location where the transaction took place.

In [64]:
df.groupby(["Country"])[["Country"]].count()

             Country
Country
Australia        205
Canada           175
India            184
New Zealand      173
UK               178
USA              179

Australia Canada India New Zealand UK USA